zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 Narek Aydinyan
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_otghs

#include <string.h>

#include <zephyr/device.h>
#include <zephyr/init.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>
#include <zephyr/usb/usb_ch9.h>

#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/usb/uhc.h>
#include <soc.h>
#include <stm32cube_hal.h>
#include <stm32_bitops.h>
#include <stm32_usb_common.h>

#include "uhc_common.h"
#include "uhc_stm32_otghs.h"

LOG_MODULE_REGISTER(uhc_stm32_otghs, CONFIG_UHC_DRIVER_LOG_LEVEL);

/* Constants */

#define USB_EP0_MPS_8  8u
#define USB_EP0_MPS_16 16u
#define USB_EP0_MPS_32 32u
#define USB_EP0_MPS_64 64u

#define STM32_OTGHS_EP_INDEX_MASK       0x0Fu
#define STM32_OTGHS_DMA_ALIGNMENT       4u

#define STM32_OTGHS_VBUS_SETTLE_US      2000u
#define STM32_OTGHS_POST_START_DELAY_MS 20u
#define STM32_OTGHS_POST_RESET_DELAY_MS 20u
#define STM32_OTGHS_RESET_FALLBACK_MS   250u

/*
 * Retry only HAL-parked NAK_WAIT channels from software.
 * 1 ms is a good starting point for USB-Ethernet receive idle periods.
 */
#define STM32_OTGHS_NAK_WAIT_RETRY_MS 1u

/*
 * Periodic wakeups are only used to re-wake the worker for HAL-parked
 * NAK_WAIT channels. When SOF support is enabled, the driver can use the
 * 1 kHz SOF interrupt instead of this timer.
 */
#define STM32_OTGHS_KICK_PERIOD_MS 1u

#define STM32_OTGHS_THREAD_PRIO_DEFAULT 14
#define STM32_OTGHS_STACK_SIZE_DEFAULT  4096u

#define STM32_MPS_DEFAULT_BULK 512u
#define STM32_MPS_DEFAULT_INTR 16u

/* Fallback for some HALs which lack these */
#ifndef CH_OUT_DIR
#define CH_OUT_DIR 0U
#endif

#ifndef CH_IN_DIR
#define CH_IN_DIR 1U
#endif

/*
 * HAL_HCD_HC_SubmitRequest() takes a token selector, not the raw HC_PID_* value:
 * 0 selects SETUP, any nonzero value selects DATA.
 */
#define STM32_HCD_TOKEN_SETUP 0U
#define STM32_HCD_TOKEN_DATA  1U

#if defined(USE_HAL_HCD_IN_NAK_AUTO_ACTIVATE_DISABLE) &&                                       \
	(USE_HAL_HCD_IN_NAK_AUTO_ACTIVATE_DISABLE == 1) && defined(HAL_HCD_CHANNEL_NAK_COUNT) &&   \
	(HAL_HCD_CHANNEL_NAK_COUNT >= 1)
#define STM32_OTGHS_HAL_IN_NAK_LIMITER_AVAILABLE 1
#define STM32_OTGHS_HAL_IN_NAK_WAIT_LIMIT        HAL_HCD_CHANNEL_NAK_COUNT
#else
#define STM32_OTGHS_HAL_IN_NAK_LIMITER_AVAILABLE 0
#define STM32_OTGHS_HAL_IN_NAK_WAIT_LIMIT        0u
#endif

#if !IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) && !STM32_OTGHS_HAL_IN_NAK_LIMITER_AVAILABLE
/*
 * Non-DMA builds require STM32 HAL support for the IN NAK limiter path.
 * The limiter parks IN BULK/CTRL channels as URB_NAK_WAIT after repeated NAKs,
 * then this driver retries from software at a lower rate. OUT retry handling
 * remains managed by the HAL. DMA builds do not require this path for direct
 * HS BULK/CTRL IN traffic.
 */
#error "Non-DMA STM32 OTGHS build requires HAL IN NAK limiter support."
#endif

#if IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA)
#define STM32_OTGHS_DIRECT_IN_NAK_PARKING 0
#else
#define STM32_OTGHS_DIRECT_IN_NAK_PARKING STM32_OTGHS_HAL_IN_NAK_LIMITER_AVAILABLE
#endif

#define STM32_EP_GET_IDX(ep) (USB_EP_GET_IDX(ep) & STM32_OTGHS_EP_INDEX_MASK)

/* Common helpers */

static void uhc_stm32_wake_worker_thread(struct stm32_otghs_data *d)
{
	k_event_post(&d->events, STM32_EVT_KICK);
}

static void uhc_stm32_signal_event_to_worker(HCD_HandleTypeDef *hhcd, uint32_t bit)
{
	struct stm32_otghs_data *d = hhcd->pData;

	__ASSERT_NO_MSG(d != NULL);

	k_event_post(&d->events, bit | STM32_EVT_KICK);
}

static void uhc_stm32_pipe_clear(struct stm32_pipe *p)
{
	p->xfer = NULL;
	p->hc = -1;
	p->ep = 0;
	p->len = 0;
	p->buf_off = 0;
	p->halted_cnt = 0;
	p->retry_timepoint = sys_timepoint_calc(K_NO_WAIT);
	memset(p->setup_words, 0, sizeof(p->setup_words));
}

static void uhc_stm32_hc_act_clear(struct stm32_hc_active *a)
{
	a->xfer = NULL;
	a->ep = 0;
	a->ep_type = 0;
	a->dir_in = 0;
	a->req_len = 0;
	a->buf_off = 0;
	a->halted_cnt = 0;
	a->mps = 0;
	a->retry_timepoint = sys_timepoint_calc(K_NO_WAIT);
}

static void uhc_stm32_hc_act_clear_all(struct stm32_otghs_data *d)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		uhc_stm32_hc_act_clear(&d->hc_act[i]);
	}
}

static bool uhc_stm32_xfer_is_active(struct stm32_otghs_data *d, struct uhc_transfer *x)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (d->hc_act[i].xfer == x) {
			return true;
		}
	}
	return false;
}

static int uhc_stm32_find_active_hc_for_xfer(struct stm32_otghs_data *d, struct uhc_transfer *x)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (d->hc_act[i].xfer == x) {
			return (int)i;
		}
	}
	return -ENOENT;
}

static bool uhc_stm32_urb_waiting_on_device(HCD_URBStateTypeDef urb_state)
{
	return (urb_state == URB_NOTREADY) || (urb_state == URB_NYET) || (urb_state == URB_IDLE);
}

static bool uhc_stm32_any_nak_wait(struct stm32_otghs_data *d)
{
	if ((d->ctrl.xfer != NULL) && (d->ctrl.hc >= 0)) {
		if (HAL_HCD_HC_GetURBState(&d->hhcd, (uint8_t)d->ctrl.hc) == URB_NAK_WAIT) {
			return true;
		}
	}

	for (uint8_t i = 0; i < d->host_channels; i++) {
		if ((d->hc_act[i].xfer != NULL) &&
		    (HAL_HCD_HC_GetURBState(&d->hhcd, i) == URB_NAK_WAIT)) {
			return true;
		}
	}

	return false;
}

static void uhc_stm32_pipe_finish(const struct device *dev, struct stm32_pipe *p, int status)
{
	struct uhc_transfer *completed = p->xfer;

	uhc_stm32_pipe_clear(p);
	if (completed != NULL) {
		uhc_xfer_return(dev, completed, status);
	}
}

static void uhc_stm32_active_xfer_finish(const struct device *dev, struct stm32_hc_active *a,
				     int status)
{
	struct uhc_transfer *completed = a->xfer;

	uhc_stm32_hc_act_clear(a);
	if (completed != NULL) {
		uhc_xfer_return(dev, completed, status);
	}
}

static void uhc_stm32_hc_halt(struct stm32_otghs_data *d, uint8_t hc)
{
	const stm32_status_t status = HAL_HCD_HC_Halt(&d->hhcd, hc);

	if (status != HAL_OK) {
		LOG_DBG("HAL_HCD_HC_Halt(%u) failed: %d", (unsigned int)hc, (int)status);
	}
}

static void uhc_stm32_pipe_cancel_and_return(const struct device *dev, struct stm32_otghs_data *d,
				   struct stm32_pipe *p, int status)
{
	if (p->xfer != NULL) {
		if (p->hc >= 0) {
			uhc_stm32_hc_halt(d, (uint8_t)p->hc);
		}
		uhc_stm32_pipe_finish(dev, p, status);
	}
}

