zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
static int uhc_stm32_hc_submit_request(struct stm32_otghs_data *d, uint8_t hc, uint8_t direction,
				   uint8_t ep_type, uint8_t token, uint8_t *data_ptr,
				   uint16_t transfer_len)
{
	if (IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) && (data_ptr != NULL) &&
	    !IS_ALIGNED((uintptr_t)data_ptr, STM32_OTGHS_DMA_ALIGNMENT)) {
		LOG_ERR("DMA buffer for HC %u is not %u-byte aligned: %p", (unsigned int)hc,
			STM32_OTGHS_DMA_ALIGNMENT, data_ptr);
		return -EINVAL;
	}

	const stm32_status_t status = HAL_HCD_HC_SubmitRequest(
		&d->hhcd, hc, direction, ep_type, token, data_ptr, transfer_len, 0u);

	return (status == HAL_OK) ? 0 : -EIO;
}

static uint32_t uhc_stm32_hc_done_bytes(struct stm32_otghs_data *d, uint8_t hc, uint16_t req_len,
					bool dir_in)
{
	uint32_t completed;

	if (IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) && dir_in) {
		const USB_OTG_HostChannelTypeDef *regs =
			(USB_OTG_HostChannelTypeDef *)((uintptr_t)d->hhcd.Instance +
						       (uintptr_t)USB_OTG_HOST_CHANNEL_BASE +
						       ((uintptr_t)hc *
							(uintptr_t)USB_OTG_HOST_CHANNEL_SIZE));
		const uint32_t remaining = regs->HCTSIZ & USB_OTG_HCTSIZ_XFRSIZ;
		const uint32_t programmed = d->hhcd.hc[hc].XferSize;

		completed = (programmed >= remaining) ? (programmed - remaining) : 0u;
	} else {
		completed = HAL_HCD_HC_GetXferCount(&d->hhcd, hc);
	}

	return MIN(completed, (uint32_t)req_len);
}

static bool uhc_stm32_hc_is_enabled(const struct stm32_otghs_data *d, uint8_t hc)
{
	const USB_OTG_HostChannelTypeDef *regs =
		(USB_OTG_HostChannelTypeDef *)((uintptr_t)d->hhcd.Instance +
					       (uintptr_t)USB_OTG_HOST_CHANNEL_BASE +
					       ((uintptr_t)hc *
						(uintptr_t)USB_OTG_HOST_CHANNEL_SIZE));

	return (regs->HCCHAR & USB_OTG_HCCHAR_CHENA) != 0u;
}

static bool uhc_stm32_nonctrl_needs_sw_retry(struct stm32_otghs_data *d, uint8_t hc,
					 HCD_URBStateTypeDef urb_state)
{
	struct stm32_hc_active *a = &d->hc_act[hc];

	if ((a->xfer == NULL) || a->dir_in) {
		return false;
	}

	if ((urb_state != URB_NOTREADY) && (urb_state != URB_IDLE)) {
		return false;
	}

	/*
	 * HAL auto-reactivates several OUT retry cases itself by setting CHENA
	 * again in the CHH handler. Only resubmit from software once the channel
	 * is actually halted and left disabled (for example, HS NYET / ping ACK).
	 */
	return !uhc_stm32_hc_is_enabled(d, hc);
}

static bool uhc_stm32_ctrl_needs_sw_retry(struct stm32_otghs_data *d, uint8_t hc,
				      HCD_URBStateTypeDef urb_state)
{
	if ((d->ctrl.xfer == NULL) || (d->ctrl.hc != (int)hc)) {
		return false;
	}

	if (USB_EP_DIR_IS_IN(d->ctrl.ep)) {
		return false;
	}

	if ((urb_state != URB_NOTREADY) && (urb_state != URB_IDLE)) {
		return false;
	}

	return !uhc_stm32_hc_is_enabled(d, hc);
}

static int uhc_stm32_commit_halted_bytes(struct uhc_transfer *xfer, uint16_t req_len,
					 uint16_t *buf_off, uint16_t *halted_cnt,
					 uint32_t hal_cnt)
{
	if ((xfer == NULL) || (xfer->buf == NULL)) {
		return 0;
	}

	if (hal_cnt < (uint32_t)*halted_cnt) {
		return -EIO;
	}

	const uint32_t add = hal_cnt - (uint32_t)*halted_cnt;

	if (add == 0u) {
		return 0;
	}

	if ((add > (uint32_t)net_buf_tailroom(xfer->buf)) ||
	    (add > ((uint32_t)req_len - (uint32_t)*halted_cnt))) {
		return -EIO;
	}

	(void)net_buf_add(xfer->buf, add);
	*buf_off += (uint16_t)add;
	*halted_cnt += (uint16_t)add;

	return 0;
}

/* Port / speed helpers */

static uint32_t uhc_stm32_read_hprt(struct stm32_otghs_data *d)
{
	volatile uint32_t *hprt = (volatile uint32_t *)((uintptr_t)d->hhcd.Instance +
						       (uintptr_t)USB_OTG_HOST_PORT_BASE);

	return stm32_reg_read(hprt);
}

static void uhc_stm32_dump_hprt(struct stm32_otghs_data *d, const char *tag)
{
	const uint32_t h = uhc_stm32_read_hprt(d);

	const unsigned int pcsts __maybe_unused = !!(h & USB_OTG_HPRT_PCSTS);
	const unsigned int pena __maybe_unused = !!(h & USB_OTG_HPRT_PENA);
	const unsigned int prst __maybe_unused = !!(h & USB_OTG_HPRT_PRST);
	const unsigned int ppwr __maybe_unused = !!(h & USB_OTG_HPRT_PPWR);
	const unsigned int pspd __maybe_unused = _FLD2VAL(USB_OTG_HPRT_PSPD, h);
	const unsigned int plsts __maybe_unused = _FLD2VAL(USB_OTG_HPRT_PLSTS, h);

	LOG_INF("[%s] HPRT=0x%08x pcsts=%u pena=%u prst=%u ppwr=%u pspd=%u plsts=%u", tag,
		(unsigned int)h, pcsts, pena, prst, ppwr, pspd, plsts);
}

static void uhc_stm32_update_dev_speed_from_hal(struct stm32_otghs_data *d)
{
	const uint32_t spd = HAL_HCD_GetCurrentSpeed(&d->hhcd);

	switch (spd) {
	case HCD_DEVICE_SPEED_HIGH:
		d->speed = HCD_DEVICE_SPEED_HIGH;
		break;
	case HCD_DEVICE_SPEED_LOW:
		d->speed = HCD_DEVICE_SPEED_LOW;
		break;
	default:
		d->speed = HCD_DEVICE_SPEED_FULL;
		break;
	}
}

/* VBUS helpers */

static void uhc_stm32_disable_vbus_sensing(struct stm32_otghs_data *d)
{
	USB_OTG_GlobalTypeDef *usb = (USB_OTG_GlobalTypeDef *)d->hhcd.Instance;

#ifdef USB_OTG_GCCFG_NOVBUSSENS
	stm32_reg_set_bits(&usb->GCCFG, USB_OTG_GCCFG_NOVBUSSENS);
#else
#ifdef USB_OTG_GCCFG_VBDEN
	/*
	 * U5 exposes this as VBDEN instead of NOVBUSSENS. Keep the documented
	 * detector bit set and force session validity through GOTGCTL below.
	 */
	stm32_reg_set_bits(&usb->GCCFG, USB_OTG_GCCFG_VBDEN);
#endif
#endif
#ifdef USB_OTG_GCCFG_DCDEN
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_DCDEN);
#endif
#ifdef USB_OTG_GCCFG_PDEN
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_PDEN);
#endif

	k_busy_wait(STM32_OTGHS_VBUS_SETTLE_US);
	LOG_INF("[VBUS-SENS] GCCFG=0x%08x", (unsigned int)usb->GCCFG);
}

static void uhc_stm32_enable_vbus_sensing(struct stm32_otghs_data *d)
{
	USB_OTG_GlobalTypeDef *usb = (USB_OTG_GlobalTypeDef *)d->hhcd.Instance;

#ifdef USB_OTG_GCCFG_NOVBUSSENS
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_NOVBUSSENS);
#endif
#ifdef USB_OTG_GCCFG_VBDEN
	stm32_reg_set_bits(&usb->GCCFG, USB_OTG_GCCFG_VBDEN);
#endif
#ifdef USB_OTG_GCCFG_DCDEN
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_DCDEN);
#endif
#ifdef USB_OTG_GCCFG_PDEN
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_PDEN);
#endif
#ifdef USB_OTG_GCCFG_VBVALEXTOEN
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_VBVALEXTOEN);
#endif
#ifdef USB_OTG_GCCFG_VBVALOVAL
	stm32_reg_clear_bits(&usb->GCCFG, USB_OTG_GCCFG_VBVALOVAL);
#endif

	stm32_reg_clear_bits(&usb->GOTGCTL,
			     USB_OTG_GOTGCTL_AVALOEN | USB_OTG_GOTGCTL_AVALOVAL |
				     USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL);

