zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	k_busy_wait(STM32_OTGHS_VBUS_SETTLE_US);
	LOG_INF("[VBUS-SENS] GCCFG=0x%08x GOTGCTL=0x%08x", (unsigned int)usb->GCCFG,
		(unsigned int)usb->GOTGCTL);
}

static void uhc_stm32_force_session_valid(struct stm32_otghs_data *d)
{
	USB_OTG_GlobalTypeDef *usb = (USB_OTG_GlobalTypeDef *)d->hhcd.Instance;

	stm32_reg_set_bits(&usb->GOTGCTL,
			   USB_OTG_GOTGCTL_AVALOEN | USB_OTG_GOTGCTL_AVALOVAL |
				   USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL);

	k_busy_wait(STM32_OTGHS_VBUS_SETTLE_US);
	LOG_INF("[VBUS-OVR] GOTGCTL=0x%08x", (unsigned int)usb->GOTGCTL);
}

/* Zephyr list helpers */

static struct uhc_transfer *uhc_stm32_peek_next_ctrl_xfer(const struct device *dev)
{
	struct uhc_data *data = dev->data;
	struct uhc_transfer *x;

	return SYS_DLIST_PEEK_HEAD_CONTAINER(&data->ctrl_xfers, x, node);
}

static bool uhc_stm32_list_contains_xfer(sys_dlist_t *list, struct uhc_transfer *xfer)
{
	struct uhc_transfer *tmp;

	SYS_DLIST_FOR_EACH_CONTAINER(list, tmp, node) {
		if (tmp == xfer) {
			return true;
		}
	}

	return false;
}

/* Channel management */

struct stm32_chan_params {
	uint8_t dev_addr;
	uint8_t ep;
	uint8_t ep_num;
	uint8_t ep_type;
	uint16_t mps;
	bool dir_in;
	uint8_t hal_ep;
};

static int uhc_stm32_find_chan(struct stm32_otghs_data *d, uint8_t dev_addr, uint8_t ep,
			       uint8_t ep_type, uint16_t mps)
{
	const bool ep0 = STM32_EP_GET_IDX(ep) == 0u;

	for (uint8_t i = 0; i < d->host_channels; i++) {
		/*
		 * EP0 channel lookup intentionally ignores MPS because EP0 MPS
		 * can be reinitialized during enumeration, while non-EP0
		 * channels still require an exact MPS match.
		 */
		if (d->ch[i].in_use && (d->ch[i].dev_addr == dev_addr) &&
		    (d->ch[i].ep == ep) && (d->ch[i].ep_type == ep_type) &&
		    (ep0 || (d->ch[i].mps == mps))) {
			return (int)d->ch[i].hc_num;
		}
	}

	return -ENOENT;
}

static void uhc_stm32_free_all_channels(struct stm32_otghs_data *d)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (d->ch[i].in_use) {
			uhc_stm32_hc_halt(d, i);
			d->ch[i].in_use = false;
		}
	}
}

static int uhc_stm32_find_idle_chan_match_nonctrl(struct stm32_otghs_data *d, uint8_t dev_addr,
					      uint8_t ep, uint8_t ep_type, uint16_t mps)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (d->ch[i].in_use && (d->hc_act[i].xfer == NULL) &&
		    (d->ch[i].dev_addr == dev_addr) && (d->ch[i].ep == ep) &&
		    (d->ch[i].ep_type == ep_type) && (d->ch[i].mps == mps)) {
			return (int)d->ch[i].hc_num;
		}
	}

	return -ENOENT;
}

static int uhc_stm32_init_free_chan(struct stm32_otghs_data *d, uint8_t hc,
				    const struct stm32_chan_params *params)
{
	stm32_status_t status;

	d->ch[hc].in_use = true;
	d->ch[hc].dev_addr = params->dev_addr;
	d->ch[hc].ep = params->ep;
	d->ch[hc].ep_num = params->ep_num;
	d->ch[hc].ep_type = params->ep_type;
	d->ch[hc].mps = params->mps;
	d->ch[hc].dir_in = params->dir_in ? 1u : 0u;
	d->ch[hc].hc_num = hc;

	status = HAL_HCD_HC_Init(&d->hhcd, hc, params->hal_ep, params->dev_addr,
				 (uint32_t)d->speed, params->ep_type, params->mps);
	if (status != HAL_OK) {
		d->ch[hc].in_use = false;
		return -EIO;
	}

	return (int)hc;
}

static int uhc_stm32_alloc_free_chan(struct stm32_otghs_data *d,
				     const struct stm32_chan_params *params)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (!d->ch[i].in_use) {
			return uhc_stm32_init_free_chan(d, i, params);
		}
	}

	return -ENOMEM;
}

static int uhc_stm32_reinit_ep0_chan_if_needed(struct stm32_otghs_data *d, uint8_t hc,
					       const struct stm32_chan_params *params)
{
	stm32_status_t status;

	if (d->ch[hc].mps == params->mps) {
		return 0;
	}

	d->ch[hc].mps = params->mps;
	uhc_stm32_hc_halt(d, hc);

	status = HAL_HCD_HC_Init(&d->hhcd, hc, params->hal_ep, params->dev_addr,
				 (uint32_t)d->speed, params->ep_type, params->mps);

	return (status == HAL_OK) ? 0 : -EIO;
}

static int uhc_stm32_alloc_or_reinit_ctrl_chan(struct stm32_otghs_data *d, uint8_t dev_addr,
					       const struct stm32_chan_params *params)
{
	const bool ep0 = (params->ep_num == 0u);
	const int existing =
		uhc_stm32_find_chan(d, dev_addr, params->ep, params->ep_type, params->mps);

	if (existing >= 0) {
		if (ep0) {
			const int ret =
				uhc_stm32_reinit_ep0_chan_if_needed(d, (uint8_t)existing, params);

			if (ret != 0) {
				return ret;
			}
		}

		return existing;
	}

	return uhc_stm32_alloc_free_chan(d, params);
}

static int uhc_stm32_alloc_or_reinit_chan(struct stm32_otghs_data *d, uint8_t dev_addr, uint8_t ep,
					  uint8_t ep_type, uint16_t mps)
{
	const bool dir_in = USB_EP_DIR_IS_IN(ep);
	const uint8_t ep_num = STM32_EP_GET_IDX(ep);
	const struct stm32_chan_params params = {
		.dev_addr = dev_addr,
		.ep = ep,
		.ep_num = ep_num,
		.ep_type = ep_type,
		.mps = mps,
		.dir_in = dir_in,
		.hal_ep = ep_num | (dir_in ? USB_EP_DIR_IN : USB_EP_DIR_OUT),
	};

	if ((ep_num == 0u) || (ep_type == EP_TYPE_CTRL)) {
		return uhc_stm32_alloc_or_reinit_ctrl_chan(d, dev_addr, &params);
	}

	const int idle = uhc_stm32_find_idle_chan_match_nonctrl(d, dev_addr, ep, ep_type, mps);

	if (idle >= 0) {
		return idle;
	}

	return uhc_stm32_alloc_free_chan(d, &params);
}

/* Submit helpers */

static uint16_t uhc_stm32_ep0_mps_default(const struct stm32_otghs_data *d,
					  const struct uhc_transfer *xfer)
{
	if (xfer->mps != 0u) {
		return xfer->mps;
	}
	if (d->ep0_mps != 0u) {
		return d->ep0_mps;
	}
	return USB_EP0_MPS_8;
}

static bool uhc_stm32_usb_req_is_in(const struct uhc_transfer *xfer)
{
	struct usb_setup_packet setup;

	memcpy(&setup, xfer->setup_pkt, sizeof(setup));
	return usb_reqtype_is_to_host(&setup);
}

static uint16_t uhc_stm32_usb_setup_wlength(const struct uhc_transfer *xfer)
{
	struct usb_setup_packet setup;

	memcpy(&setup, xfer->setup_pkt, sizeof(setup));
	return sys_le16_to_cpu(setup.wLength);
}

static bool uhc_stm32_ep_has_active_xfer(struct stm32_otghs_data *d, uint8_t dev_addr, uint8_t ep)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if ((d->hc_act[i].xfer != NULL) && (d->hc_act[i].xfer->udev != NULL) &&
		    (d->hc_act[i].xfer->udev->addr == dev_addr) &&
		    (d->hc_act[i].ep == ep)) {
			return true;
		}
	}

