zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	return false;
}

static uint32_t uhc_stm32_out_submit_len(uint8_t ep_type, uint16_t mps,
					 uint32_t remaining)
{
	if (!IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) && (ep_type == EP_TYPE_BULK) && (mps > 0u)) {
		return MIN(remaining, (uint32_t)mps);
	}

	return remaining;
}

static int uhc_stm32_submit_control(struct stm32_otghs_data *d, struct uhc_transfer *xfer)
{
	if ((d == NULL) || (xfer == NULL) || (xfer->udev == NULL)) {
		return -EINVAL;
	}

	const uint8_t dev_addr = xfer->udev->addr;
	const uint16_t wLength = uhc_stm32_usb_setup_wlength(xfer);

	const bool req_in = uhc_stm32_usb_req_is_in(xfer);
	const bool has_data = (wLength != 0u);

	const uint16_t mps = uhc_stm32_ep0_mps_default(d, xfer);

	uint8_t ep = 0u;
	uint8_t dir = 0u;
	uint8_t token = 0u;
	uint8_t *data_ptr = NULL;
	uint32_t transfer_len = 0u;

	if (xfer->stage == UHC_CONTROL_STAGE_SETUP) {
		ep = USB_CONTROL_EP_OUT;
		dir = CH_OUT_DIR;
		token = STM32_HCD_TOKEN_SETUP;
		memcpy(d->ctrl.setup_words, xfer->setup_pkt, sizeof(xfer->setup_pkt));
		data_ptr = (uint8_t *)d->ctrl.setup_words;
		transfer_len = sizeof(xfer->setup_pkt);

	} else if ((xfer->stage == UHC_CONTROL_STAGE_DATA) && (xfer->buf != NULL) && has_data) {
		ep = req_in ? USB_CONTROL_EP_IN : USB_CONTROL_EP_OUT;
		dir = req_in ? CH_IN_DIR : CH_OUT_DIR;
		token = STM32_HCD_TOKEN_DATA;

		/*
		 * For IN, buf->len may carry the requested receive length. Reset it
		 * before arming the HAL transfer so completion can append actual bytes.
		 * For OUT, buf->len is already the payload length to send.
		 */
		if (req_in) {
			uint32_t want = (xfer->buf->len != 0u) ? (uint32_t)xfer->buf->len
							       : (uint32_t)wLength;
			want = MIN(want, (uint32_t)wLength);

			xfer->buf->len = 0u;
			want = MIN(want, (uint32_t)net_buf_tailroom(xfer->buf));
			data_ptr = xfer->buf->data;
			transfer_len = want;
		} else {
			data_ptr = xfer->buf->data;
			transfer_len = MIN((uint32_t)wLength, (uint32_t)xfer->buf->len);
		}

		if (transfer_len == 0u) {
			return -EINVAL;
		}

	} else if (xfer->stage == UHC_CONTROL_STAGE_STATUS) {
		const bool status_in = !req_in;

		ep = status_in ? USB_CONTROL_EP_IN : USB_CONTROL_EP_OUT;
		dir = status_in ? CH_IN_DIR : CH_OUT_DIR;
		token = STM32_HCD_TOKEN_DATA;
		data_ptr = (uint8_t *)&d->zlp_dummy;
		transfer_len = 0u;

	} else {
		return -EINVAL;
	}

	const int hc = uhc_stm32_alloc_or_reinit_chan(d, dev_addr, ep, EP_TYPE_CTRL, mps);

	if (hc < 0) {
		return hc;
	}

	const int ret = uhc_stm32_hc_submit_request(d, (uint8_t)hc, dir, EP_TYPE_CTRL, token,
						data_ptr, (uint16_t)transfer_len);
	if (ret != 0) {
		return ret;
	}

	d->ctrl.xfer = xfer;
	d->ctrl.hc = hc;
	d->ctrl.ep = ep;
	d->ctrl.len = (uint16_t)transfer_len;
	d->ctrl.buf_off = 0u;
	d->ctrl.halted_cnt = 0u;
	d->ctrl.retry_timepoint = sys_timepoint_calc(K_MSEC(STM32_OTGHS_NAK_WAIT_RETRY_MS));

	return 0;
}

static int uhc_stm32_resubmit_control_same_hc(struct stm32_otghs_data *d)
{
	struct stm32_pipe *p = &d->ctrl;
	struct uhc_transfer *xfer = p->xfer;
	uint16_t transfer_len = p->len;
	uint32_t buf_limit;
	uint8_t *data_ptr;

	if ((xfer == NULL) || (xfer->udev == NULL) || (p->hc < 0)) {
		return -EINVAL;
	}

	if ((xfer->stage != UHC_CONTROL_STAGE_DATA) || !uhc_stm32_usb_req_is_in(xfer) ||
	    (xfer->buf == NULL)) {
		return uhc_stm32_submit_control(d, xfer);
	}

	if (p->halted_cnt > transfer_len) {
		return -EINVAL;
	}

	transfer_len -= p->halted_cnt;
	buf_limit = (uint32_t)xfer->buf->len + (uint32_t)net_buf_tailroom(xfer->buf);
	if (((uint32_t)p->buf_off + (uint32_t)transfer_len) > buf_limit) {
		return -EINVAL;
	}
	data_ptr = xfer->buf->data + p->buf_off;

	const int ret = uhc_stm32_hc_submit_request(d, (uint8_t)p->hc, CH_IN_DIR, EP_TYPE_CTRL,
						STM32_HCD_TOKEN_DATA, data_ptr, transfer_len);
	if (ret != 0) {
		return ret;
	}

	p->len = transfer_len;
	p->halted_cnt = 0u;
	p->retry_timepoint = sys_timepoint_calc(K_MSEC(STM32_OTGHS_NAK_WAIT_RETRY_MS));

	return 0;
}

static int uhc_stm32_submit_nonctrl(struct stm32_otghs_data *d, struct uhc_transfer *xfer)
{
	if ((d == NULL) || (xfer == NULL) || (xfer->udev == NULL) || (xfer->buf == NULL)) {
		return -EINVAL;
	}

	const uint8_t dev_addr = xfer->udev->addr;
	const uint8_t ep = xfer->ep;
	const bool dir_in = USB_EP_DIR_IS_IN(ep);

	uint8_t ep_type;

	switch (xfer->type) {
	case USB_EP_TYPE_BULK:
		ep_type = EP_TYPE_BULK;
		break;
	case USB_EP_TYPE_INTERRUPT:
		ep_type = EP_TYPE_INTR;
		break;
	default:
		return -ENOTSUP;
	}

	uint16_t mps = xfer->mps;

	if (mps == 0u) {
		mps = (ep_type == EP_TYPE_INTR) ? STM32_MPS_DEFAULT_INTR : STM32_MPS_DEFAULT_BULK;
	}

	uint32_t transfer_len = 0u;
	uint8_t *data_ptr = xfer->buf->data;

	if (dir_in) {
		const uint32_t cap =
			(uint32_t)net_buf_tailroom(xfer->buf) + (uint32_t)xfer->buf->len;
		uint32_t want = (xfer->buf->len != 0u) ? (uint32_t)xfer->buf->len : cap;

		xfer->buf->len = 0u;
		want = MIN(want, cap);
		transfer_len = want;
	} else {
		transfer_len = uhc_stm32_out_submit_len(ep_type, mps, (uint32_t)xfer->buf->len);
	}

	if (transfer_len == 0u) {
		return -EINVAL;
	}

	/* Toggle state is tracked per endpoint, so keep one active transfer per endpoint. */
	if (uhc_stm32_ep_has_active_xfer(d, dev_addr, ep)) {
		return -EBUSY;
	}

	const int hc = uhc_stm32_alloc_or_reinit_chan(d, dev_addr, ep, ep_type, mps);

	if (hc < 0) {
		return hc;
	}

	if (d->hc_act[hc].xfer != NULL) {
		return -EBUSY;
	}

	const int ret = uhc_stm32_hc_submit_request(d, (uint8_t)hc,
						dir_in ? CH_IN_DIR : CH_OUT_DIR, ep_type,
						STM32_HCD_TOKEN_DATA, data_ptr,
						(uint16_t)transfer_len);
	if (ret != 0) {
		return ret;
	}

	d->hc_act[hc].xfer = xfer;
	d->hc_act[hc].ep = ep;
	d->hc_act[hc].ep_type = ep_type;
	d->hc_act[hc].dir_in = dir_in ? 1u : 0u;
	d->hc_act[hc].req_len = (uint16_t)transfer_len;
	d->hc_act[hc].buf_off = 0u;
	d->hc_act[hc].halted_cnt = 0u;
	d->hc_act[hc].mps = mps;
	d->hc_act[hc].retry_timepoint =
		sys_timepoint_calc(K_MSEC(STM32_OTGHS_NAK_WAIT_RETRY_MS));

	return 0;
}

static int uhc_stm32_resubmit_nonctrl_same_hc(struct stm32_otghs_data *d, int hc)
{
	struct stm32_hc_active *a = &d->hc_act[hc];
	struct uhc_transfer *xfer = a->xfer;
	uint16_t req_len = a->req_len;
	uint32_t buf_limit;

	if ((xfer == NULL) || (xfer->udev == NULL) || (xfer->buf == NULL)) {
		return -EINVAL;
	}

