zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	if (a->dir_in) {
		if (a->halted_cnt > req_len) {
			return -EINVAL;
		}

		req_len -= a->halted_cnt;
		buf_limit = (uint32_t)xfer->buf->len + (uint32_t)net_buf_tailroom(xfer->buf);
	} else {
		buf_limit = (uint32_t)xfer->buf->len;
	}

	if (((uint32_t)a->buf_off + (uint32_t)req_len) > buf_limit) {
		return -EINVAL;
	}

	uint8_t *data_ptr = xfer->buf->data + a->buf_off;

	const int ret = uhc_stm32_hc_submit_request(d, (uint8_t)hc,
						a->dir_in ? CH_IN_DIR : CH_OUT_DIR, a->ep_type,
						STM32_HCD_TOKEN_DATA, data_ptr, req_len);
	if (ret != 0) {
		return ret;
	}

	a->req_len = req_len;
	a->halted_cnt = 0u;
	a->retry_timepoint = sys_timepoint_calc(K_MSEC(STM32_OTGHS_NAK_WAIT_RETRY_MS));
	return 0;
}

/* Completion */

static bool uhc_stm32_is_std_get_device_desc(const struct uhc_transfer *xfer)
{
	struct usb_setup_packet setup;

	memcpy(&setup, xfer->setup_pkt, sizeof(setup));

	const bool std_type = (USB_REQTYPE_GET_TYPE(setup.bmRequestType) ==
			       USB_REQTYPE_TYPE_STANDARD);
	const bool get_desc = (setup.bRequest == USB_SREQ_GET_DESCRIPTOR);
	const bool device_desc = (USB_GET_DESCRIPTOR_TYPE(sys_le16_to_cpu(setup.wValue)) ==
				  USB_DESC_DEVICE);

	return std_type && get_desc && device_desc;
}

static void uhc_stm32_ep0_force_data1_after_setup(struct stm32_otghs_data *d, uint8_t dev_addr)
{
	/*
	 * HAL keeps separate channel state for EP0 IN and OUT, but a SETUP packet
	 * resets both control data toggles. Seed both cached directions so the
	 * following DATA or STATUS stage starts with DATA1.
	 */
	const int hc_out =
		uhc_stm32_find_chan(d, dev_addr, USB_CONTROL_EP_OUT, EP_TYPE_CTRL, d->ep0_mps);
	const int hc_in =
		uhc_stm32_find_chan(d, dev_addr, USB_CONTROL_EP_IN, EP_TYPE_CTRL, d->ep0_mps);

	if (hc_out >= 0) {
		d->hhcd.hc[hc_out].toggle_in = 1u;
		d->hhcd.hc[hc_out].toggle_out = 1u;
	}
	if (hc_in >= 0) {
		d->hhcd.hc[hc_in].toggle_in = 1u;
		d->hhcd.hc[hc_in].toggle_out = 1u;
	}
}

static uint8_t uhc_stm32_ctrl_stage_ep(const struct uhc_transfer *xfer, bool req_in)
{
	if (xfer->stage == UHC_CONTROL_STAGE_SETUP) {
		return USB_CONTROL_EP_OUT;
	}

	if (xfer->stage == UHC_CONTROL_STAGE_DATA) {
		return req_in ? USB_CONTROL_EP_IN : USB_CONTROL_EP_OUT;
	}

	return req_in ? USB_CONTROL_EP_OUT : USB_CONTROL_EP_IN;
}

static bool uhc_stm32_ctrl_handle_wait_or_error(const struct device *dev,
					    struct stm32_otghs_data *d,
					    struct stm32_pipe *p,
					    struct uhc_transfer *xfer, uint8_t hc,
					    HCD_URBStateTypeDef urb_state,
					    uint32_t hal_cnt)
{
	const bool req_in = uhc_stm32_usb_req_is_in(xfer);

	if (uhc_stm32_ctrl_needs_sw_retry(d, hc, urb_state)) {
		const int r = uhc_stm32_submit_control(d, xfer);

		if (r != 0) {
			uhc_stm32_pipe_finish(dev, p, r);
		}
		return true;
	}

	if (uhc_stm32_urb_waiting_on_device(urb_state)) {
		return true;
	}

	if (urb_state == URB_NAK_WAIT) {
		if ((xfer->stage == UHC_CONTROL_STAGE_DATA) && req_in) {
			const int pr = uhc_stm32_commit_halted_bytes(
				p->xfer, p->len, &p->buf_off, &p->halted_cnt, hal_cnt);

			if (pr != 0) {
				uhc_stm32_pipe_finish(dev, p, pr);
				return true;
			}
		}

		if (!sys_timepoint_expired(p->retry_timepoint)) {
			return true;
		}

		const int r = uhc_stm32_resubmit_control_same_hc(d);

		if (r != 0) {
			uhc_stm32_pipe_finish(dev, p, r);
		}
		return true;
	}

	if (urb_state == URB_STALL) {
		uhc_stm32_pipe_finish(dev, p, -EPIPE);
		return true;
	}

	if (urb_state != URB_DONE) {
		uhc_stm32_pipe_finish(dev, p, -EIO);
		return true;
	}

	return false;
}

static void uhc_stm32_ctrl_complete_setup(const struct device *dev, struct stm32_otghs_data *d,
				      struct stm32_pipe *p, struct uhc_transfer *xfer,
				      uint8_t dev_addr, bool has_data)
{
	uhc_stm32_ep0_force_data1_after_setup(d, dev_addr);

	if (has_data) {
		if (xfer->buf == NULL) {
			uhc_stm32_pipe_finish(dev, p, -EINVAL);
			return;
		}
		xfer->stage = UHC_CONTROL_STAGE_DATA;
	} else {
		xfer->stage = UHC_CONTROL_STAGE_STATUS;
	}

	const int r = uhc_stm32_submit_control(d, xfer);

	if (r != 0) {
		uhc_stm32_pipe_finish(dev, p, r);
	}
}

static void uhc_stm32_ctrl_maybe_update_ep0_mps(struct stm32_otghs_data *d,
						struct uhc_transfer *xfer)
{
	if ((xfer->buf->len < USB_EP0_MPS_8) || !uhc_stm32_is_std_get_device_desc(xfer)) {
		return;
	}

	const struct usb_device_descriptor *dev_desc = (const void *)xfer->buf->data;
	const uint8_t mps0 = dev_desc->bMaxPacketSize0;

	if ((mps0 == USB_EP0_MPS_8) || (mps0 == USB_EP0_MPS_16) ||
	    (mps0 == USB_EP0_MPS_32) || (mps0 == USB_EP0_MPS_64)) {
		d->ep0_mps = mps0;
	}
}

static void uhc_stm32_ctrl_complete_data(const struct device *dev, struct stm32_otghs_data *d,
				     struct stm32_pipe *p, struct uhc_transfer *xfer, bool req_in,
				     uint32_t hal_cnt)
{
	if (req_in && (xfer->buf != NULL) && (hal_cnt > 0u)) {
		const uint32_t add = MIN(hal_cnt, (uint32_t)net_buf_tailroom(xfer->buf));

		(void)net_buf_add(xfer->buf, add);
		uhc_stm32_ctrl_maybe_update_ep0_mps(d, xfer);
	}

	xfer->stage = UHC_CONTROL_STAGE_STATUS;

	const int r = uhc_stm32_submit_control(d, xfer);

	if (r != 0) {
		uhc_stm32_pipe_finish(dev, p, r);
	}
}

static void uhc_stm32_complete_control_pipe(const struct device *dev, struct stm32_otghs_data *d,
					struct stm32_pipe *p)
{
	struct uhc_transfer *xfer = p->xfer;

	if ((xfer == NULL) || (xfer->udev == NULL)) {
		return;
	}

	const uint8_t dev_addr = xfer->udev->addr;
	const uint16_t wLength = uhc_stm32_usb_setup_wlength(xfer);
	const bool req_in = uhc_stm32_usb_req_is_in(xfer);
	const bool has_data = (wLength != 0u);
	const uint16_t mps = uhc_stm32_ep0_mps_default(d, xfer);
	const uint8_t stage_ep = uhc_stm32_ctrl_stage_ep(xfer, req_in);

	const int hc = uhc_stm32_find_chan(d, dev_addr, stage_ep, EP_TYPE_CTRL, mps);

	if (hc < 0) {
		uhc_stm32_pipe_finish(dev, p, -EIO);
		return;
	}

	const HCD_URBStateTypeDef urb_state = HAL_HCD_HC_GetURBState(&d->hhcd, (uint8_t)hc);
	const uint32_t hal_cnt =
		uhc_stm32_hc_done_bytes(d, (uint8_t)hc, p->len, USB_EP_DIR_IS_IN(stage_ep));

	if (uhc_stm32_ctrl_handle_wait_or_error(dev, d, p, xfer, (uint8_t)hc, urb_state, hal_cnt)) {
		return;
	}

	if (xfer->stage == UHC_CONTROL_STAGE_SETUP) {
		uhc_stm32_ctrl_complete_setup(dev, d, p, xfer, dev_addr, has_data);
		return;
	}

	if (xfer->stage == UHC_CONTROL_STAGE_DATA) {
		uhc_stm32_ctrl_complete_data(dev, d, p, xfer, req_in, hal_cnt);
		return;
	}

	uhc_stm32_pipe_finish(dev, p, 0);
}

static void uhc_stm32_cancel_all_nonctrl(const struct device *dev, struct stm32_otghs_data *d,
					 int st)
{
	for (uint8_t i = 0; i < d->host_channels; i++) {
		if (d->hc_act[i].xfer != NULL) {
			uhc_stm32_hc_halt(d, i);
			uhc_xfer_return(dev, d->hc_act[i].xfer, st);
			uhc_stm32_hc_act_clear(&d->hc_act[i]);
		}
	}
}

static bool uhc_stm32_nonctrl_continue_out(const struct device *dev, struct stm32_otghs_data *d,
				       struct stm32_hc_active *a, int hc)
{
	struct uhc_transfer *xfer = a->xfer;
	const uint32_t total = (uint32_t)xfer->buf->len;
	const uint32_t next_off = (uint32_t)a->buf_off + (uint32_t)a->req_len;

	if (next_off >= total) {
		return false;
	}

