zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	const uint32_t remaining = total - next_off;
	const uint32_t next_len = uhc_stm32_out_submit_len(a->ep_type, a->mps, remaining);
	int r;

	a->buf_off = (uint16_t)next_off;
	a->req_len = (uint16_t)next_len;

	r = uhc_stm32_resubmit_nonctrl_same_hc(d, hc);
	if (r != 0) {
		uhc_stm32_active_xfer_finish(dev, a, r);
	}

	return true;
}

static void uhc_stm32_nonctrl_complete_done(const struct device *dev, struct stm32_otghs_data *d,
					struct stm32_hc_active *a, int hc, uint32_t hal_cnt)
{
	struct uhc_transfer *xfer = a->xfer;

	if (a->dir_in && (xfer->buf != NULL) && (hal_cnt > 0u)) {
		const uint32_t add = MIN(hal_cnt, (uint32_t)net_buf_tailroom(xfer->buf));

		(void)net_buf_add(xfer->buf, add);
	}

	/*
	 * STM32 HAL non-DMA toggle tracking bug for OUT transfers only.
	 *
	 * OUT (non-DMA): the CHH handler XORs toggle_out exactly once per
	 * transfer completion regardless of packet count. For even-packet
	 * transfers the two per-packet flips cancel, so the net toggle must
	 * be unchanged but HAL has already flipped it once.
	 *
	 * IN (non-DMA): HAL already updates toggle_in per packet path.
	 */
	if (!IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) && !a->dir_in && (a->mps != 0u) &&
	    (a->req_len != 0u) && ((DIV_ROUND_UP(a->req_len, a->mps) & 1u) == 0u)) {
		d->hhcd.hc[hc].toggle_out ^= 1u;
	}

	if (!a->dir_in && (xfer->buf != NULL) &&
	    uhc_stm32_nonctrl_continue_out(dev, d, a, hc)) {
		return;
	}

	uhc_stm32_active_xfer_finish(dev, a, 0);
}

static bool uhc_stm32_nonctrl_handle_wait_or_error(const struct device *dev,
						   struct stm32_otghs_data *d,
						   struct stm32_hc_active *a, int hc,
						   HCD_URBStateTypeDef urb_state,
						   uint32_t hal_cnt)
{
	if (uhc_stm32_nonctrl_needs_sw_retry(d, (uint8_t)hc, urb_state)) {
		const int r = uhc_stm32_resubmit_nonctrl_same_hc(d, hc);

		if (r != 0) {
			uhc_stm32_active_xfer_finish(dev, a, r);
		}
		return true;
	}

	if (uhc_stm32_urb_waiting_on_device(urb_state)) {
		return true;
	}

	if (urb_state == URB_NAK_WAIT) {
		int pr = 0;

		if (a->dir_in) {
			pr = uhc_stm32_commit_halted_bytes(a->xfer, a->req_len, &a->buf_off,
							   &a->halted_cnt, hal_cnt);
		}

		if (pr != 0) {
			uhc_stm32_active_xfer_finish(dev, a, pr);
			return true;
		}

		if (!sys_timepoint_expired(a->retry_timepoint)) {
			return true;
		}

		const int r = uhc_stm32_resubmit_nonctrl_same_hc(d, hc);

		if (r != 0) {
			uhc_stm32_active_xfer_finish(dev, a, r);
		}
		return true;
	}

	if (urb_state == URB_STALL) {
		uhc_stm32_active_xfer_finish(dev, a, -EPIPE);
		return true;
	}

	if (urb_state != URB_DONE) {
		uhc_stm32_active_xfer_finish(dev, a, -EIO);
		return true;
	}

	return false;
}

static void uhc_stm32_complete_one_hc(const struct device *dev, struct stm32_otghs_data *d, int hc)
{
	struct stm32_hc_active *a = &d->hc_act[hc];
	struct uhc_transfer *xfer = a->xfer;

	if ((xfer == NULL) || (xfer->udev == NULL)) {
		return;
	}

	const HCD_URBStateTypeDef urb_state = HAL_HCD_HC_GetURBState(&d->hhcd, (uint8_t)hc);
	const uint32_t hal_cnt =
		uhc_stm32_hc_done_bytes(d, (uint8_t)hc, a->req_len, a->dir_in != 0u);

	if (uhc_stm32_nonctrl_handle_wait_or_error(dev, d, a, hc, urb_state, hal_cnt)) {
		return;
	}

	uhc_stm32_nonctrl_complete_done(dev, d, a, hc, hal_cnt);
}

/* Scheduling */

static void uhc_stm32_schedule_nonctrl_fill(const struct device *dev, struct stm32_otghs_data *d)
{
	struct uhc_data *ud = dev->data;

	if (sys_dlist_is_empty(&ud->bulk_xfers)) {
		return;
	}

	while (true) {
		uint32_t active = 0;
		bool saw_candidate = false;
		bool made_progress = false;
		struct uhc_transfer *x;

		for (uint8_t i = 0; i < d->host_channels; i++) {
			active += (d->hc_act[i].xfer != NULL) ? 1u : 0u;
		}

		if (active >= STM32_OTGHS_MAX_INFLIGHT_BULK) {
			break;
		}

		SYS_DLIST_FOR_EACH_CONTAINER(&ud->bulk_xfers, x, node) {
			if ((STM32_EP_GET_IDX(x->ep) == 0u) || uhc_stm32_xfer_is_active(d, x)) {
				continue;
			}

			saw_candidate = true;

			const int r = uhc_stm32_submit_nonctrl(d, x);

			if (r == 0) {
				made_progress = true;
				break;
			}

			if (r == -EBUSY) {
				/* Same endpoint already active; try another queued transfer. */
				continue;
			}

			uhc_xfer_return(dev, x, r);
		}

		if (!saw_candidate || !made_progress) {
			break;
		}
	}
}

static void uhc_stm32_schedule_xfers(const struct device *dev, struct stm32_otghs_data *d)
{
	if (!d->connected || !d->bus_ready) {
		return;
	}

	if (d->ctrl.xfer == NULL) {
		struct uhc_transfer *x = uhc_stm32_peek_next_ctrl_xfer(dev);

		if (x != NULL) {
			const int r = uhc_stm32_submit_control(d, x);

			if (r == -EBUSY) {
				return;
			}
			if (r != 0) {
				uhc_xfer_return(dev, x, r);
			}
		}
	}

	uhc_stm32_schedule_nonctrl_fill(dev, d);
}

/* Timer callback */

static void uhc_stm32_periodic_wake_stop(struct stm32_otghs_data *d)
{
	atomic_set(&d->sof_tick_active, 0);
	k_timer_stop(&d->kick_timer);
}

static void uhc_stm32_periodic_wake_update(struct stm32_otghs_data *d)
{
	const bool need_periodic = d->connected && d->bus_ready && uhc_stm32_any_nak_wait(d);

	if (atomic_get(&d->sof_irq_enabled) != 0) {
		atomic_set(&d->sof_tick_active, need_periodic ? 1 : 0);
		k_timer_stop(&d->kick_timer);
		return;
	}

	atomic_set(&d->sof_tick_active, 0);
	if (need_periodic) {
		k_timer_start(&d->kick_timer, K_MSEC(STM32_OTGHS_KICK_PERIOD_MS),
			      K_MSEC(STM32_OTGHS_KICK_PERIOD_MS));
	} else {
		k_timer_stop(&d->kick_timer);
	}
}

static void uhc_stm32_kick_timer_cb(struct k_timer *t)
{
	struct stm32_otghs_data *d = (struct stm32_otghs_data *)k_timer_user_data_get(t);

	if (d->connected && d->bus_ready && uhc_stm32_any_nak_wait(d)) {
		uhc_stm32_wake_worker_thread(d);
	}
}

/* ISR */

static void uhc_stm32_otghs_isr(const struct device *dev)
{
	struct stm32_otghs_data *d = uhc_get_private(dev);

	__ASSERT_NO_MSG(d != NULL);
	__ASSERT_NO_MSG(d->hhcd.Instance != NULL);

	HAL_HCD_IRQHandler(&d->hhcd);
}

/* HAL callbacks */

void HAL_HCD_PortEnabled_Callback(HCD_HandleTypeDef *hhcd)
{
	uhc_stm32_signal_event_to_worker(hhcd, STM32_EVT_PEN);
}

void HAL_HCD_PortDisabled_Callback(HCD_HandleTypeDef *hhcd)
{
	uhc_stm32_signal_event_to_worker(hhcd, STM32_EVT_PDIS);
}

