zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
void HAL_HCD_Connect_Callback(HCD_HandleTypeDef *hhcd)
{
	uhc_stm32_signal_event_to_worker(hhcd, STM32_EVT_CONN);
}

void HAL_HCD_Disconnect_Callback(HCD_HandleTypeDef *hhcd)
{
	uhc_stm32_signal_event_to_worker(hhcd, STM32_EVT_DISCONN);
}

void HAL_HCD_SOF_Callback(HCD_HandleTypeDef *hhcd)
{
	struct stm32_otghs_data *d = hhcd->pData;

	__ASSERT_NO_MSG(d != NULL);

	if (atomic_get(&d->sof_tick_active) != 0) {
		uhc_stm32_wake_worker_thread(d);
	}
}

void HAL_HCD_HC_NotifyURBChange_Callback(HCD_HandleTypeDef *hhcd, uint8_t chnum,
					 HCD_URBStateTypeDef urb_state)
{
	struct stm32_otghs_data *d = hhcd->pData;

	__ASSERT_NO_MSG(d != NULL);

	/*
	 * Do not wake the worker for every transient URB_NOTREADY / URB_IDLE /
	 * URB_NYET. That causes useless thread churn under NAK storms.
	 *
	 * Wake immediately only when HAL has halted an OUT/control-OUT channel
	 * and left it disabled, which means software must submit again
	 * (for example, HS NYET or ping/ACK paths). HAL-parking in URB_NAK_WAIT
	 * also wakes the worker; the timer then rate-limits retries.
	 */
	switch (urb_state) {
	case URB_NOTREADY:
	case URB_IDLE:
		if (uhc_stm32_nonctrl_needs_sw_retry(d, chnum, urb_state) ||
		    uhc_stm32_ctrl_needs_sw_retry(d, chnum, urb_state)) {
			uhc_stm32_wake_worker_thread(d);
		}
		break;

	case URB_NYET:
		break;

	default:
		uhc_stm32_wake_worker_thread(d);
		break;
	}
}

/* Thread */

static void uhc_stm32_thread_handle_disconnect(const struct device *dev, struct stm32_otghs_data *d,
					   bool *was_present)
{
	uhc_stm32_periodic_wake_stop(d);

	d->connected = false;
	d->bus_ready = false;
	d->reset_pending = false;
	d->ep0_mps = 0u;

	uhc_stm32_free_all_channels(d);
	uhc_stm32_pipe_cancel_and_return(dev, d, &d->ctrl, -ENODEV);
	uhc_stm32_cancel_all_nonctrl(dev, d, -ENODEV);

	if (*was_present) {
		uhc_submit_event(dev, UHC_EVT_DEV_REMOVED, 0);
	}

	*was_present = false;
}

static void uhc_stm32_thread_handle_connect(const struct device *dev, struct stm32_otghs_data *d,
					bool *was_present)
{
	uhc_stm32_dump_hprt(d, "EVT:CONNECT");

	d->connected = true;
	d->bus_ready = false;
	d->reset_pending = false;
	d->ep0_mps = USB_EP0_MPS_8;
	d->zlp_dummy = 0u;

	uhc_stm32_periodic_wake_stop(d);
	uhc_stm32_free_all_channels(d);
	uhc_stm32_pipe_clear(&d->ctrl);
	uhc_stm32_hc_act_clear_all(d);
	uhc_stm32_update_dev_speed_from_hal(d);

	if (d->speed == HCD_DEVICE_SPEED_HIGH) {
		uhc_submit_event(dev, UHC_EVT_DEV_CONNECTED_HS, 0);
	} else if (d->speed == HCD_DEVICE_SPEED_LOW) {
		uhc_submit_event(dev, UHC_EVT_DEV_CONNECTED_LS, 0);
	} else {
		uhc_submit_event(dev, UHC_EVT_DEV_CONNECTED_FS, 0);
	}

	*was_present = true;
}

static void uhc_stm32_thread(void *p1, void *p2, void *p3)
{
	ARG_UNUSED(p2);
	ARG_UNUSED(p3);

	struct stm32_otghs_data *d = p1;
	const struct device *dev = d->dev;
	bool was_present = false;

	while (true) {
		const uint32_t flags = k_event_wait_safe(&d->events, UINT32_MAX, false,
							 K_FOREVER);

		uhc_lock_internal(dev, K_FOREVER);

		if ((flags & (STM32_EVT_DISCONN | STM32_EVT_PDIS)) != 0u) {
			uhc_stm32_thread_handle_disconnect(dev, d, &was_present);
			uhc_unlock_internal(dev);
			continue;
		}

		if ((flags & STM32_EVT_CONN) != 0u) {
			uhc_stm32_thread_handle_connect(dev, d, &was_present);
		}

		if ((flags & STM32_EVT_PEN) != 0u) {
			uhc_stm32_dump_hprt(d, "EVT:PEN");
			uhc_stm32_update_dev_speed_from_hal(d);

			if (d->reset_pending) {
				d->reset_pending = false;
				k_msleep(STM32_OTGHS_POST_RESET_DELAY_MS);

				d->bus_ready = true;
				uhc_stm32_periodic_wake_update(d);

				uhc_submit_event(dev, UHC_EVT_RESETED, 0);
			}
		}

		if (d->reset_pending && sys_timepoint_expired(d->reset_timepoint) &&
		    ((uhc_stm32_read_hprt(d) & USB_OTG_HPRT_PENA) != 0u)) {
			d->reset_pending = false;
			d->bus_ready = true;
			uhc_stm32_periodic_wake_update(d);

			uhc_submit_event(dev, UHC_EVT_RESETED, 0);
		}

		if (!d->connected || !d->bus_ready) {
			uhc_unlock_internal(dev);
			continue;
		}

		if (d->ctrl.xfer != NULL) {
			uhc_stm32_complete_control_pipe(dev, d, &d->ctrl);
		}

		for (uint8_t hc = 0; hc < d->host_channels; hc++) {
			if (d->hc_act[hc].xfer != NULL) {
				uhc_stm32_complete_one_hc(dev, d, (int)hc);
			}
		}

		uhc_stm32_schedule_xfers(dev, d);
		uhc_stm32_periodic_wake_update(d);

		uhc_unlock_internal(dev);
	}
}

/* Hardware init helpers */

static void uhc_stm32_log_feature_config(const struct stm32_otghs_data *d __maybe_unused)
{
	const bool sof_irq_enabled __maybe_unused = (atomic_get(&d->sof_irq_enabled) != 0);

	LOG_INF("[CFG] dma=%s sof=%s wake=%s force_vbus_valid=%s "
		"vbus_sensing=%s in_nak_park=%s",
		IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) ? "on" : "off",
		sof_irq_enabled ? "on" : "off",
		sof_irq_enabled ? "sof" : "timer",
		IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID) ? "on" : "off",
		IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID) ? "off" : "on",
		STM32_OTGHS_DIRECT_IN_NAK_PARKING ? "on" : "off");

	if (STM32_OTGHS_DIRECT_IN_NAK_PARKING) {
		LOG_INF("[CFG] in_nak_wait_limit=%u retry_ms=%u dma_align=%u",
			(unsigned int)STM32_OTGHS_HAL_IN_NAK_WAIT_LIMIT,
			(unsigned int)STM32_OTGHS_NAK_WAIT_RETRY_MS,
			(unsigned int)STM32_OTGHS_DMA_ALIGNMENT);
	} else {
		LOG_INF("[CFG] in_nak_wait_limit=disabled retry_ms=%u dma_align=%u",
			(unsigned int)STM32_OTGHS_NAK_WAIT_RETRY_MS,
			(unsigned int)STM32_OTGHS_DMA_ALIGNMENT);
	}
}

static int uhc_stm32_clock_enable(const struct stm32_otghs_config *cfg)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int ret;

	if (cfg->num_clocks > 1) {
		ret = clock_control_configure(clk, &cfg->pclken[1], NULL);
		if (ret != 0) {
			LOG_ERR("Could not select USB domain clock");
			return ret;
		}
	}

	ret = clock_control_on(clk, &cfg->pclken[0]);
	if (ret != 0) {
		LOG_ERR("Unable to enable USB clock");
		return ret;
	}

	if (cfg->phy != NULL) {
		ret = cfg->phy->enable(cfg->phy);
		if (ret != 0) {
			int off_ret;

			LOG_ERR("Failed to enable USB PHY: %d", ret);
			off_ret = clock_control_off(clk, &cfg->pclken[0]);
			if (off_ret != 0) {
				LOG_WRN("Unable to roll back USB clock enable: %d", off_ret);
			}
			return ret;
		}
	}

