zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	return 0;
}

static int uhc_stm32_clock_disable(const struct stm32_otghs_config *cfg)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int ret = 0;
	int err;

	if (cfg->phy != NULL) {
		err = cfg->phy->disable(cfg->phy);
		if (err != 0) {
			LOG_ERR("Failed to disable USB PHY: %d", err);
			ret = err;
		}
	}

	err = clock_control_off(clk, &cfg->pclken[0]);
	if (err != 0) {
		LOG_ERR("Unable to disable USB clock: %d", err);
		if (ret == 0) {
			ret = err;
		}
	}

	return ret;
}

static int uhc_stm32_clock_power_disable(const struct stm32_otghs_config *cfg)
{
	int ret = 0;
	int err;

	err = uhc_stm32_clock_disable(cfg);
	if (err != 0) {
		ret = err;
	}

	err = stm32_usb_pwr_disable();
	if (err != 0) {
		LOG_ERR("Unable to disable USB power: %d", err);
		if (ret == 0) {
			ret = err;
		}
	}

	return ret;
}

/* UHC API */

static int uhc_stm32_lock(const struct device *dev)
{
	return uhc_lock_internal(dev, K_FOREVER);
}

static int uhc_stm32_unlock(const struct device *dev)
{
	return uhc_unlock_internal(dev);
}

static int uhc_stm32_init(const struct device *dev)
{
	struct stm32_otghs_data *d = uhc_get_private(dev);
	const struct stm32_otghs_config *cfg = dev->config;
	int ret;

	d->connected = false;
	d->bus_ready = false;
	d->reset_pending = false;
	d->host_channels = cfg->host_channels;
	atomic_set(&d->sof_irq_enabled, 0);
	atomic_set(&d->sof_tick_active, 0);

	uhc_stm32_pipe_clear(&d->ctrl);
	uhc_stm32_hc_act_clear_all(d);

	uhc_stm32_free_all_channels(d);

	d->ep0_mps = USB_EP0_MPS_8;
	d->zlp_dummy = 0u;

	ret = stm32_usb_pwr_enable();
	if (ret != 0) {
		LOG_ERR("Error enabling USB power: %d", ret);
		return ret;
	}

	ret = uhc_stm32_clock_enable(cfg);
	if (ret != 0) {
		const int disable_ret = stm32_usb_pwr_disable();

		if (disable_ret != 0) {
			LOG_WRN("Unable to roll back USB power enable: %d", disable_ret);
		}
		return ret;
	}

	memset(&d->hhcd, 0, sizeof(d->hhcd));
	d->hhcd.Instance = cfg->base;

	d->hhcd.Init.Host_channels = cfg->host_channels;
	d->hhcd.Init.speed = HCD_SPEED_HIGH;
	d->speed = HCD_DEVICE_SPEED_HIGH;

	d->hhcd.Init.dma_enable = IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA);
	d->hhcd.Init.phy_itface = USB_OTG_HS_EMBEDDED_PHY;
	d->hhcd.Init.Sof_enable = IS_ENABLED(CONFIG_UHC_STM32_OTGHS_SOF);
	d->hhcd.Init.low_power_enable = DISABLE;
	d->hhcd.Init.use_external_vbus = !IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID);
	d->hhcd.Init.vbus_sensing_enable = !IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID);

	d->hhcd.pData = d;

	stm32_status_t status = HAL_HCD_Init(&d->hhcd);

	if (status != HAL_OK) {
		int cleanup_ret;

		LOG_ERR("HAL_HCD_Init failed");
		cleanup_ret = uhc_stm32_clock_power_disable(cfg);
		if (cleanup_ret != 0) {
			LOG_WRN("USB cleanup after HAL_HCD_Init failure returned %d", cleanup_ret);
		}
		return -EIO;
	}

	if (IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID)) {
		uhc_stm32_disable_vbus_sensing(d);
		uhc_stm32_force_session_valid(d);
	} else {
		uhc_stm32_enable_vbus_sensing(d);
	}

	status = HAL_HCD_Start(&d->hhcd);
	if (status != HAL_OK) {
		int cleanup_ret;
		stm32_status_t deinit_status;

		LOG_ERR("HAL_HCD_Start failed");
		deinit_status = HAL_HCD_DeInit(&d->hhcd);
		if (deinit_status != HAL_OK) {
			LOG_WRN("HAL_HCD_DeInit after start failure returned %d",
				(int)deinit_status);
		}
		cleanup_ret = uhc_stm32_clock_power_disable(cfg);
		if (cleanup_ret != 0) {
			LOG_WRN("USB cleanup after HAL_HCD_Start failure returned %d", cleanup_ret);
		}
		return -EIO;
	}

	stm32_reg_write(&d->hhcd.Instance->GINTSTS, UINT32_MAX);
	atomic_set(&d->sof_irq_enabled, IS_ENABLED(CONFIG_UHC_STM32_OTGHS_SOF));
	uhc_stm32_log_feature_config(d);

	k_msleep(STM32_OTGHS_POST_START_DELAY_MS);
	uhc_stm32_dump_hprt(d, "INIT");

	return 0;
}

static int uhc_stm32_enable(const struct device *dev)
{
	uhc_stm32_wake_worker_thread(uhc_get_private(dev));
	return 0;
}

static int uhc_stm32_disable(const struct device *dev)
{
	uhc_stm32_periodic_wake_stop(uhc_get_private(dev));
	return 0;
}

static int uhc_stm32_shutdown(const struct device *dev)
{
	struct stm32_otghs_data *d = uhc_get_private(dev);
	const struct stm32_otghs_config *cfg = dev->config;
	stm32_status_t stop_status;
	stm32_status_t deinit_status;
	int ret = 0;
	int cleanup_ret;

	uhc_stm32_periodic_wake_stop(d);

	stop_status = HAL_HCD_Stop(&d->hhcd);
	deinit_status = HAL_HCD_DeInit(&d->hhcd);

	if (stop_status != HAL_OK) {
		LOG_ERR("HAL_HCD_Stop failed: %d", (int)stop_status);
		ret = -EIO;
	}

	if (deinit_status != HAL_OK) {
		LOG_ERR("HAL_HCD_DeInit failed: %d", (int)deinit_status);
		if (ret == 0) {
			ret = -EIO;
		}
	}

	cleanup_ret = uhc_stm32_clock_power_disable(cfg);
	if ((cleanup_ret != 0) && (ret == 0)) {
		ret = cleanup_ret;
	}

	return ret;
}

static int uhc_stm32_bus_reset(const struct device *dev)
{
	struct stm32_otghs_data *d = uhc_get_private(dev);

	d->bus_ready = false;
	d->reset_pending = true;
	d->reset_timepoint = sys_timepoint_calc(K_MSEC(STM32_OTGHS_RESET_FALLBACK_MS));
	uhc_stm32_periodic_wake_stop(d);

	uhc_stm32_pipe_cancel_and_return(dev, d, &d->ctrl, -EAGAIN);
	uhc_stm32_cancel_all_nonctrl(dev, d, -EAGAIN);
	uhc_stm32_free_all_channels(d);

	const stm32_status_t status = HAL_HCD_ResetPort(&d->hhcd);

	if (status != HAL_OK) {
		d->reset_pending = false;
		LOG_ERR("HAL_HCD_ResetPort failed");
		return -EIO;
	}

	return 0;
}

static int uhc_stm32_sof_enable(const struct device *dev)
{
	struct stm32_otghs_data *d = uhc_get_private(dev);

	if (atomic_get(&d->sof_irq_enabled) != 0) {
		return -EALREADY;
	}

	stm32_reg_set_bits(&d->hhcd.Instance->GINTMSK, USB_OTG_GINTMSK_SOFM);
	d->hhcd.Init.Sof_enable = ENABLE;
	atomic_set(&d->sof_irq_enabled, 1);
	uhc_stm32_periodic_wake_update(d);
	LOG_INF("[CFG] SOF interrupt delivery enabled at runtime");
	LOG_INF("[CFG] dma=%s sof=%s wake=%s force_vbus_valid=%s",
		IS_ENABLED(CONFIG_UHC_STM32_OTGHS_DMA) ? "on" : "off",
		(atomic_get(&d->sof_irq_enabled) != 0) ? "on" : "off",
		(atomic_get(&d->sof_irq_enabled) != 0) ? "sof" : "timer",
		IS_ENABLED(CONFIG_UHC_STM32_OTGHS_FORCE_VBUS_VALID) ? "on" : "off");

