zephyrproject-rtos/zephyr/drivers/usb/uhc/uhc_stm32_otghs.c
	return 0;
}

static int uhc_stm32_bus_suspend(const struct device *dev)
{
	uhc_stm32_periodic_wake_stop(uhc_get_private(dev));
	uhc_submit_event(dev, UHC_EVT_SUSPENDED, 0);
	return 0;
}

static int uhc_stm32_bus_resume(const struct device *dev)
{
	uhc_stm32_periodic_wake_update(uhc_get_private(dev));
	uhc_submit_event(dev, UHC_EVT_RESUMED, 0);
	return 0;
}

static int uhc_stm32_ep_enqueue(const struct device *dev, struct uhc_transfer *const xfer)
{
	struct uhc_data *data = dev->data;
	struct stm32_otghs_data *d = uhc_get_private(dev);

	if (STM32_EP_GET_IDX(xfer->ep) == 0u) {
		sys_dlist_append(&data->ctrl_xfers, &xfer->node);
	} else {
		sys_dlist_append(&data->bulk_xfers, &xfer->node);
	}

	uhc_stm32_wake_worker_thread(d);
	return 0;
}

static int uhc_stm32_ep_dequeue(const struct device *dev, struct uhc_transfer *const xfer)
{
	struct uhc_data *data = dev->data;
	struct stm32_otghs_data *d = uhc_get_private(dev);

	if (xfer == NULL) {
		return -EINVAL;
	}

	if (uhc_stm32_list_contains_xfer(&data->ctrl_xfers, xfer) ||
	    uhc_stm32_list_contains_xfer(&data->bulk_xfers, xfer)) {
		/* uhc_xfer_return() removes the transfer from its queued list node. */
		uhc_xfer_return(dev, xfer, -ECONNRESET);
		uhc_stm32_wake_worker_thread(d);
		return 0;
	}

	if (d->ctrl.xfer == xfer) {
		uhc_stm32_pipe_cancel_and_return(dev, d, &d->ctrl, -ECONNRESET);
		uhc_stm32_wake_worker_thread(d);
		return 0;
	}

	const int hc = uhc_stm32_find_active_hc_for_xfer(d, xfer);

	if (hc >= 0) {
		uhc_stm32_hc_halt(d, (uint8_t)hc);
		uhc_xfer_return(dev, xfer, -ECONNRESET);
		uhc_stm32_hc_act_clear(&d->hc_act[hc]);

		uhc_stm32_wake_worker_thread(d);
	}

	return 0;
}

static const struct uhc_api stm32_uhc_api = {
	.lock = uhc_stm32_lock,
	.unlock = uhc_stm32_unlock,
	.init = uhc_stm32_init,
	.enable = uhc_stm32_enable,
	.disable = uhc_stm32_disable,
	.shutdown = uhc_stm32_shutdown,

	.bus_reset = uhc_stm32_bus_reset,
	.sof_enable = uhc_stm32_sof_enable,
	.bus_suspend = uhc_stm32_bus_suspend,
	.bus_resume = uhc_stm32_bus_resume,

	.ep_enqueue = uhc_stm32_ep_enqueue,
	.ep_dequeue = uhc_stm32_ep_dequeue,
};

/* Device init / registration */

static int uhc_stm32_driver_preinit(const struct device *dev)
{
	struct uhc_data *data = dev->data;
	struct stm32_otghs_data *d = data->priv;
	const struct stm32_otghs_config *cfg = dev->config;
	int ret;

	k_mutex_init(&data->mutex);
	d->dev = dev;
	d->host_channels = cfg->host_channels;

	k_event_init(&d->events);

	k_timer_init(&d->kick_timer, uhc_stm32_kick_timer_cb, NULL);
	k_timer_user_data_set(&d->kick_timer, d);

	k_thread_create(&d->thread, cfg->stack, cfg->stack_size, uhc_stm32_thread, d, NULL,
			NULL, cfg->thread_prio, 0, K_NO_WAIT);
	k_thread_name_set(&d->thread, dev->name);

	cfg->irq_connect();

	ret = pinctrl_apply_state(cfg->pincfg, PINCTRL_STATE_DEFAULT);

	/* Ignore -ENOENT returned on series without pinctrl */
	if (ret < 0 && ret != -ENOENT) {
		LOG_ERR("pinctrl apply failed: %d", ret);
		return ret;
	}

	uhc_stm32_wake_worker_thread(d);
	return 0;
}

#define STM32_OTGHS_INST_DEFINE(n)							\
	BUILD_ASSERT(DT_INST_PROP(n, num_host_channels) <= STM32_OTGHS_MAX_CH,		\
		     "STM32 OTGHS host channel count exceeds driver channel "		\
		     "array size");							\
											\
	static void uhc_stm32_irq_connect_##n(void)					\
	{										\
		IRQ_CONNECT(DT_INST_IRQN(n), DT_INST_IRQ(n, priority),			\
			    uhc_stm32_otghs_isr, DEVICE_DT_INST_GET(n), 0);		\
		irq_enable(DT_INST_IRQN(n));						\
	}										\
											\
	static K_KERNEL_STACK_DEFINE(stm32_otghs_stack_##n,				\
				     STM32_OTGHS_STACK_SIZE_DEFAULT);			\
											\
	PINCTRL_DT_INST_DEFINE(n);							\
											\
	static const struct stm32_pclken stm32_otghs_pclken_##n[] =			\
		STM32_DT_CLOCKS(DT_DRV_INST(n));					\
											\
	static struct stm32_otghs_data stm32_otghs_priv_##n;				\
											\
	static struct uhc_data stm32_uhc_data_##n = {					\
		.priv = &stm32_otghs_priv_##n,						\
	};										\
											\
	static const struct stm32_otghs_config stm32_otghs_cfg_##n = {			\
		.base = (void *)DT_INST_REG_ADDR(n),					\
		.irq_connect = uhc_stm32_irq_connect_##n,				\
		.pincfg = PINCTRL_DT_INST_DEV_CONFIG_GET(n),				\
		.pclken = (struct stm32_pclken *)stm32_otghs_pclken_##n,		\
		.num_clocks = DT_INST_NUM_CLOCKS(n),					\
		.phy = USB_STM32_PHY_PSEUDODEV_GET_OR_NULL(DT_DRV_INST(n)),		\
		.host_channels = DT_INST_PROP(n, num_host_channels),			\
		.stack = stm32_otghs_stack_##n,						\
		.stack_size = K_KERNEL_STACK_SIZEOF(stm32_otghs_stack_##n),		\
		.thread_prio = K_PRIO_PREEMPT(STM32_OTGHS_THREAD_PRIO_DEFAULT),	        \
	};										\
											\
	DEVICE_DT_INST_DEFINE(n, uhc_stm32_driver_preinit, NULL,			\
			      &stm32_uhc_data_##n, &stm32_otghs_cfg_##n,		\
			      POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,		\
			      &stm32_uhc_api);

#define STM32_OTGHS_INST_DEFINE_IF_HOST(n)						\
	COND_CODE_1(DT_INST_NODE_HAS_PROP(n, num_host_channels),			\
		    (STM32_OTGHS_INST_DEFINE(n)), ())

DT_INST_FOREACH_STATUS_OKAY(STM32_OTGHS_INST_DEFINE_IF_HOST)
